import React from "react";
import { notFound } from "next/navigation";
import {Grid, Typography, Paper, CardMedia} from "@mui/material";
import BlogDetailMeta from "@/components/blog/BlogDetailMeta"
import DEFAULT_PLACEHOLDER from "@/images/placeholders/blog-cover.png"
import {getPostBySlug} from "@/lib/api/blog";

type Props = {
    params: { slug: string };
};

export default async function BlogDetail({ params }: Props) {
    const post = await getPostBySlug(params.slug);
    if (!post) {
        notFound();
    }
    const content = " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\n" +
        "                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\n" +
        "                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\n" +
        "                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\n"
    return (
        <Grid container spacing={2} sx={{ p: 2 }}>

            {/* ستون سمت راست - سایدبار (30%) */}
            <Grid item xs={12} md={3} order={{ xs: 2, md: 1}}>
                <Paper sx={{ p: 2, position: "sticky", top: 20 }}>
                    <Typography variant="h6" gutterBottom>
                        مقالات مرتبط
                    </Typography>
                    <ul>
                        <li>مقاله ۱</li>
                        <li>مقاله ۲</li>
                        <li>مقاله ۳</li>
                    </ul>
                </Paper>
            </Grid>

            {/* ستون سمت چپ - محتوای اصلی (70%) */}
            <Grid item xs={12} md={9} order={{ xs: 1, md: 2}}>
                <Paper sx={{ p: 2 }}>
                    <Typography variant="h4" gutterBottom>
                        {post.title}
                    </Typography>

                    {/* Meta */}
                    <BlogDetailMeta content={content} />

                    {/* image */}
                    <CardMedia
                        component="img"
                        image={DEFAULT_PLACEHOLDER.src}
                        alt="Article header"
                        sx={{ borderRadius: 2, my: 2 }}
                    />

                    <Typography variant="body1" paragraph textAlign="justify" className="font-300">
                        {post.content}
                    </Typography>
                </Paper>
            </Grid>

        </Grid>
    );
}
